package org.java.distribute;

//http://blog.csdn.net/he90227/article/details/51154429
public class 微服务 {
    
    
    
    
    
    
    
    
    
    
    
    
    /*
     * 服务的类型
     * 1.injvm
     * 2.remote
     * 
     */
    
    
    /*
     * 
     * 代理
     * 
     * 路由
     * 
     * 负载均衡
     * 
     * 降级
     * 
     * 限流
     * 
     * 
     * 
     *                         ---注册中心-----  
     *                                    --服务动态治理
     *                                    --服务自动注册自动发现
     * 
     * 服务
     * 
     * 降级
     * 
     * 
     * 流控
     * 
     * 容错(熔断)
     * 
     * 
     * 
     *             消费端              
     *                    代理
     *                     |
     *                     |
     *                     |
     *                     |
     *                    \|/
     *                    路由
     *                     |
     *                     |
     *                     |
     *                     |
     *                    \|/
     *                  负载均衡
     *                     |
     *                     |
     *                     |
     *                     |
     *                    \|/
     *                    降级
     *                     |                                     
     *                     |
     *                     |
     *                     |                                    异常返回 (容错降级)容错逻辑                         短路降级
     *                    \|/                        正常返回                /   Failsafe(失败安全)          /  mock
     *                    限流                                                                            |        /    failback 失败自动恢复                     /
     *                     |                          |       /     fialfast 快速失败                           /
     *                     |                          |      /      failover 失败转移                         /
     *            ---------|--------------------------|-----/-----------------------------/
     *                     |                          |             
     *                    \|/                         |
     *                    降级                                                                            |
     *                     |                          |
     *                     |                          |
     *                     |                          |
     *                     |                          |
     *                    \|/                         |
     *                    流控                                                                            |
     *                     |                          |
     *                     |                          |
     *                     |                          |
     *                     |                          |
     *                    \|/                         |
     *                   容错(熔断)--------------------服务调用
     *                     
     *               
     *                   
     *                   
     * 
     * 
     * 
     * 
     */

}
