package org.java.distribute.acid;

public class Tcp_Ip {
    
    
    
    
    
    
    
    
    
    
    /*
     * 
     * 
     *           应用层          不同的协议: http pop 等
     *           
     *           
     *           传输层tcp  保证可靠性传送   如 重传  还有端口标识那个进程
     *           
     *           
     *           
     *           网际层 ip  网络 ip
     *           
     *           
     *           
     *           物理层         物理设备  mac地址
     *           
     *           
     *           
     *           
     *           
     *           
     *           传送分类 ：面向连接，无面向连接
     *           
     *           tpc/ip 面向连接的分组发送
     *           
     *           网络通信: 电路交换，分组交换
     *           
     *           
     *           分组交换 问题:
     *           1)链路的拥塞
     *           2)传送中介 路由器缓存饱和或溢出，导致丢包
     *           
     *           
     *           
     *           
     *           发送目标地址的多少分类:
     *           1)单播
     *           2)广播
     *           3)多播
     *           4)任播
     *           
     *           
     *           地址：
     *           mac地址
     *           
     *           ip地址
     *            ip地址具有层次性
     *            
     *            
     *            转发列表:
     *             mac 地址转发表
     *             ip  路由控制表
     *           
     *           
     *           
     * 
     * 
     * 
     * 
     * 
     * 
     * 
     * 
     * 
     * 
     * 
     */

}
